[{
  "name": "A4:  🍅cards",
  "description": "Der Kubus beschreibt die Bonusoptionen auf  🍅cards.",
  "date": "2019-05-02T07:17:13.451Z",
  "dateUpdated": "2019-08-17T15:01:39.253Z",
  "editors": [],
  "owner": "jCZ6oHcbZhJaKKodN",
  "visible": true,
  "ratings": true,
  "kind": "free",
  "price": 0,
  "reviewed": false,
  "reviewer": "undefined",
  "request": false,
  "rating": 0,
  "raterCount": 0,
  "quantity": 1,
  "license": [
    "by",
    "nc",
    "sa"
  ],
  "userDeleted": false,
  "learningActive": false,
  "maxCards": 0,
  "daysBeforeReset": 0,
  "learningStart": "1970-01-01T00:00:00.000Z",
  "learningEnd": "1970-01-01T00:00:00.000Z",
  "registrationPeriod": "1970-01-01T00:00:00.000Z",
  "learningInterval": [],
  "wordcloud": false,
  "shuffled": false,
  "cardType": 18,
  "difficulty": 0,
  "noDifficulty": false,
  "sortType": 1,
  "originalAuthorName": {
    "title": "Dr.",
    "birthname": "Quibeldey-Cirkel",
    "givenname": "Klaus"
  },
  "workload": {
    "bonus": {
      "count": 0,
      "minLearned": 75
    },
    "normal": {
      "count": 0
    },
    "simulator": {
      "errorCount": [
        [
          100,
          30,
          25,
          20,
          10
        ]
      ]
    }
  },
  "gotWorkload": false,
  "lecturerAuthorized": false,
  "lastEditor": "jCZ6oHcbZhJaKKodN"
}, {
  "subject": "Bonusoptionen auf  🍅cards",
  "front": "(#) Warum Bonuspunkte?\n\nLernen ist <q>intrinsisch</q> oder <q>extrinsisch</q> motiviert: durch einen von innen gesteuerten Lernantrieb oder durch äußere Anreizfaktoren. Kindliche Neugier, spiel- und interessengeleitetes Lernen gelten als Prototypen intrinsischer Motivation. Das Streben nach guten Noten oder eine auf materielle Vergütung zielende Lernbereitschaft sind typische Beispiele für extrinsische Motivation. Die meisten Studierenden lernen nicht intrinsisch motiviert, also aus eigenem Antrieb während des Semesters; sie schieben das Lernen auf (Prokrastination) und lernen massiert wenige Tage vor der Klausur (Bulimielernen).\n\n**Bonuspunkte motivieren extrinsisch und das in vielerlei Hinsicht auf 🍅cards:**\n\n* Mit Quizzen im Hörsaal erfährt der Einzelne individuelles Feedback zu seinem Lernprozess. Die Lehrperson kann Quizze als Live-Assessment der Gruppen-Lernleistung für die inhaltliche Gestaltung des weiteren Unterrichts nutzen. Diese Rückkopplung fördert die Selbstwirksamkeitserfahrung und somit auch das intrinsisch motivierte Lernen.\n* Bonuspunkte, die nur während der Veranstaltung zu erwerben sind, erhöhen nachweislich die Präsenz in den Vorlesungen. Die Lehrperson kann Bonuspunkte fürs Mitschreiben und Nachbearbeiten der Mitschrift sowie fürs aktive Fragenstellen während der Vorlesung vergeben. \n* Bonuspunkte für verteiltes und wiederholtes Lernen nach  Leitner fördern die Lernmotivation außerhalb der Präsenzzeiten.",
  "back": "(#) Das Prüfungsamt zu Bonuspunkten [^Prüfungsamt]\n\n!!! TIP Was sind Bonuspunkte?\n   <kbd>Modulnotenverbesserungen</kbd> durch freiwillig erbrachte Zusatzleistungen wie zum Beispiel Probeklausuren, zusätzliche Übungen oder Referate. Sie sind kein Bestandteil der Modulprüfung.\n\n!!! WARNING Wann kann ich die freiwilligen Leistungen erbringen?\n   <kbd>Während der Veranstaltungszeiten</kbd>\n\n!!! NOTE Kann ich mit Bonuspunkten meine Modulnote verbessern?\n   Ja. Die freiwillig erbrachten Leistungen können eine Verbesserung bis zu <kbd>maximal 10 Prozentpunkte</kbd> der rechnerisch ermittelten Modulnote ergeben.\n\n[^Prüfungsamt] [Website des THM-Prüfungsamts](https://www.thm.de/site/hochschule/zentrale-bereiche/pruefungsamt/faq.html#bonuspunkte-an-der-thm) und [§ 9 Abs. 4 der Allgemeinen Bestimmungen für\nBachelorprüfungsordnungen](https://www.thm.de/site/studium/sie-studieren/pruefungsordnung/1687-allgemeine-bestimmungen-fuer-bachelorpruefungordnungen-2014-version-3/download.html)",
  "hint": "(#) Bonus für die Teilnahme an Hörsaal-Quizzen\n\n!!! Warning Technik\n   Die in  🍅cards integrierte gamifizierte Quiz-App [arsnova.click](https://arsnova.click) ermöglicht eine CAS-Authentifizierung. Aktiviert die Lehrperson diese, werden in der Exportdatei des Quiz-Rankings die THM-Mailadressen der Spieler/innen aufgenommen. Die Lehrperson kann somit für die Bonusvergabe den Pseudonymen der Quiz-Teilnehmenden deren Identitäten zuordnen.\n\n!!! Tip Didaktik\n   Bonus-Quizze können zu Beginn einer Vorlesung das Wissen aus vorausgegangenen Vorlesungen und Übungen prüfen. Zum Ende einer Vorlesung dienen sie als Anreiz zum aktiven Zuhören, da das Wissen der Teilnehmenden über die aktuell vermittelten Lehrinhalte geprüft wird.",
  "lecture": "(#) Bonus fürs Mitschreiben und Nachbearbeiten\n\n!!! Warning Technik\n   Die Lehrperson legt eine Kartei vom Typ <q>Vorlesung mit Mitschreib-Bonus</q> an, wählt aus einem Kalender die Vorlesungstermine aus, bestimmt die Frist für das Nachbearbeiten einer Mitschrift und legt die maximale Anzahl Bonuspunkte fest. Die Studierenden können innerhalb der Frist eine Kartei vom Typ <q>Mitschrift</q> mit der Kartei der Vorlesung koppeln, ihre fotografierte Mitschrift auf einer Karte verlinken und die Nachbearbeitung (recherchierte Reinschrift) digital erstellen.\n\n!!! Tip Didaktik\n   Es müssen nicht alle Vorlesungen mitgeschrieben werden, um die maximale Anzahl Bonuspunkte zu erwerben, zum Beispiel nur 10 von 14 Vorlesungen. Die fotografierten Mitschriften und die digitale Nachbearbeitung innerhalb der Frist wird von einem Tutor oder der Lehrperson auf Sinnhaftigkeit, nicht aber Richtigkeit geprüft, denn es soll nur belohnt werden, dass man sich während der Vorlesung und zuhause aktiv mit den Lerninhalten auseinandergesetzt hat. ",
  "top": "(#) Bonus für aktive Beteiligung am Unterricht\n\n!!! Warning Technik\n   Auf 🍅cards können Bonuspunkte für das **Fragenstellen** mit dem integrierten Audience-Response-System <q>[frag.jetzt](https://frag.jetzt)</q> (funktional vergleichbar mit <q>[Pigeonhole live](http://pigeonholelive.com/)</q>) erworben werden.\n\n!!! Tip Didaktik\n   Die Fragen müssen sich auf die Inhalte der aktuellen Vorlesung beziehen und:   \n   1. von einem Moderator (Tutor) in die Fragenliste der Vorlesung aufgenommen,\n   * von den Teilnehmenden hochgerankt und \n   * von der Lehrperson noch in der Vorlesung behandelt worden sein.",
  "bottom": "(#) Bonus für regelmäßig wiederholtes Lernen\n\n!!! Warning Technik\n   Bestimmte Karteitypen, zum Beispiel Glossar, Anweisungssatz, Quiz oder Prüfung, bieten die Option <q>Lernen nach Plan</q> an, entweder nach Leitner oder nach Woźniak. Die Lehrperson kann die Leitner-Option mit einer Bonusvergabe koppeln: Sie legt das Tages-Pensum an zu lernenden Karten fest, bestimmt  Start, Ende und Wiederholungsintervalle sowie die maximale ununterbrochene tägliche Lernzeit in Pomodoro-Einheiten.\n\n!!! Tip Didaktik\n   Anhand der Lernkurve über die Wiederholungsintervalle beurteilt die Lehrperson oder der Tutor am Ende der Lernperiode, ob  regelmäßig und wiederholt gelernt wurde und vergibt entsprechend Bonuspunkte für den individuellen Lernprozess.",
  "centerTextElement": [
    true,
    true,
    true,
    true,
    true,
    true
  ],
  "alignType": [
    0,
    0,
    0,
    0,
    0,
    0
  ],
  "date": "2019-05-02T07:34:07.801Z",
  "learningGoalLevel": 0,
  "backgroundStyle": 1,
  "owner": "jCZ6oHcbZhJaKKodN",
  "dateUpdated": "2019-08-17T15:01:39.234Z",
  "originalAuthorName": {
    "title": "Dr.",
    "birthname": "Quibeldey-Cirkel",
    "givenname": "Klaus"
  },
  "lastEditor": "jCZ6oHcbZhJaKKodN"
}]